[Killed] OptionalChaining
src/core/db.js:179:12
    */
   export async function getOpenRouterKey() {
     const data = await getSetting(OPENROUTER_KEY);
-    return data?.key || null;
+    return data.key || null;
   }
 
killedBy: OpenRouter Key Storage should remove OpenRouter key
statusReason: Cannot read properties of undefined (reading 'key')
