[Killed] EqualityOperator
src/utils/storage.js:33:7
  * @returns {number} Size in bytes
  */
 function getJsonSize(value) {
-  if (value === null || value === undefined) return 0;
+  if (value !== null || value === undefined) return 0;
   try {
     return new Blob([JSON.stringify(value)]).size;
killedBy: Storage Utilities getStorageBreakdown should return minimal size for empty storage
statusReason: expected '8 B' to be '0 B' // Object.is equality
