[Killed] BlockStatement
src/utils/gradeProgression.js:49:36
  */
 export function getContinuesUntilNextLevel(continueCount) {
   for (const threshold of PROGRESSION_THRESHOLDS) {
-    if (continueCount < threshold) {
-      return threshold - continueCount;
-    }
+    if (continueCount < threshold) {}
   }
   return null; // Already at max progression
killedBy: gradeProgression getContinuesUntilNextLevel should return continues until first threshold
statusReason: expected null to be 2 // Object.is equality
