[Killed] BlockStatement
src/utils/shuffle.js:40:29
     return question;
   }
 
-  if (options.length === 1) {
-    return question;
-  }
+  if (options.length === 1) {}
 
   // Create indices array and shuffle it
killedBy: shuffleQuestionOptions should handle question with single option
statusReason: expected { question: 'Only one option?', …(2) } to be { question: 'Only one option?', …(2) } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: { question: 'Only one option?', …(2) }
Received: serializes to the same string
