[Survived] StringLiteral
src/core/db.js:23:42
             // Create 'sessions' object store
             if (!db.objectStoreNames.contains('sessions')) {
                 const sessionStore = db.createObjectStore('sessions', { keyPath: 'id', autoIncrement: true  });
-                sessionStore.createIndex('byTopicId', 'topicId');
+                sessionStore.createIndex("", 'topicId');
                 sessionStore.createIndex('byTimestamp', 'timestamp');
             }

[Killed] BlockStatement
src/core/db.js:87:55
     return db.getAll('sessions');
   }
 
-  export async function getRecentSessions(limit = 10) {
-    const db = await getDB();
-    const all = await db.getAllFromIndex('sessions', 'byTimestamp');
-    return all.reverse().slice(0, limit);
-  }
+  export async function getRecentSessions(limit = 10) {}
 
   export async function updateSession(id, updates) {
killedBy: Sessions CRUD Operations should get recent sessions sorted by timestamp
statusReason: Cannot read properties of undefined (reading '0')

[Killed] MethodExpression
src/core/db.js:90:12
   export async function getRecentSessions(limit = 10) {
     const db = await getDB();
     const all = await db.getAllFromIndex('sessions', 'byTimestamp');
-    return all.reverse().slice(0, limit);
+    return all.reverse();
   }
 
killedBy: Sessions CRUD Operations should limit recent sessions to specified amount
statusReason: expected [ { topicId: 'math', …(3) }, …(12) ] to have a length of 5 but got 13

[Killed] MethodExpression
src/core/db.js:90:12
   export async function getRecentSessions(limit = 10) {
     const db = await getDB();
     const all = await db.getAllFromIndex('sessions', 'byTimestamp');
-    return all.reverse().slice(0, limit);
+    return all.slice(0, limit);
   }
 
killedBy: Sessions CRUD Operations should get recent sessions sorted by timestamp
statusReason: expected 1767603602092 to be greater than 1767603604092

[Killed] BlockStatement
src/core/db.js:93:52
     return all.reverse().slice(0, limit);
   }
 
-  export async function updateSession(id, updates) {
-    const db = await getDB();
-    const session = await db.get('sessions', id);
-    if (!session) return null;
-
-    const updatedSession = { ...session, ...updates };
-    await db.put('sessions', updatedSession);
-    return updatedSession;
-  }
+  export async function updateSession(id, updates) {}
 
   /**
killedBy: updateSession - Quiz Replay should update existing session with new data
statusReason: Cannot read properties of undefined (reading 'score')

[Killed] ObjectLiteral
src/core/db.js:98:28
     const session = await db.get('sessions', id);
     if (!session) return null;
 
-    const updatedSession = { ...session, ...updates };
+    const updatedSession = {};
     await db.put('sessions', updatedSession);
     return updatedSession;
killedBy: updateSession - Quiz Replay should update existing session with new data
statusReason: expected undefined to be 5 // Object.is equality

[NoCoverage] EqualityOperator
src/core/db.js:117:31
     if (!session) return null;
 
     // Ensure questions array exists and index is valid
-    if (!session.questions || questionIndex < 0 || questionIndex >= session.questions.length) {
+    if (!session.questions || questionIndex <= 0 || questionIndex >= session.questions.length) {
       return null;
     }

[NoCoverage] ConditionalExpression
src/core/db.js:117:9
     if (!session) return null;
 
     // Ensure questions array exists and index is valid
-    if (!session.questions || questionIndex < 0 || questionIndex >= session.questions.length) {
+    if (true) {
       return null;
     }

[NoCoverage] ConditionalExpression
src/core/db.js:139:11
     const allSessions = await db.getAll('sessions');
 
     for (const session of allSessions) {
-      if (session.isSample) {
+      if (false) {
         await db.delete('sessions', session.id);
       }

[Killed] ConditionalExpression
src/core/db.js:212:11
     // Delete all non-sample sessions
     const allSessions = await db.getAll('sessions');
     for (const session of allSessions) {
-      if (!session.isSample) {
+      if (false) {
         await db.delete('sessions', session.id);
       }
killedBy: getAllSessions should only contain sample sessions after clearAllUserData
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/core/db.js:224:43
     }
 
     // Clear all settings
-    const tx = db.transaction('settings', 'readwrite');
+    const tx = db.transaction('settings', "");
     await tx.store.clear();
     await tx.done;
killedBy: getAllSessions should return all sessions
statusReason: Invalid mode:
