[Killed] ObjectLiteral
src/core/features.js:11:23
    */
 
   export const FEATURE_FLAGS = {
-    OPENROUTER_GUIDE: {
-      phase: 'ENABLED',
-      description: 'New OpenRouter connection guide with step-by-step instructions'
-    },
+    OPENROUTER_GUIDE: {},
     TELEMETRY: {
       phase: 'ENABLED',  // Start disabled until VPS endpoint is ready
killedBy: Feature Flags getFeaturePhase should return current phase for known feature
statusReason: expected [ 'DISABLED', 'SETTINGS_ONLY', …(1) ] to include 'UNKNOWN'

[Survived] StringLiteral
src/core/features.js:20:14
       description: 'Send telemetry (logs, errors, metrics) to VPS for debugging'
     },
     EXPLANATION_FEATURE: {
-      phase: 'ENABLED',  // Enabled for testing
+      phase: "",  // Enabled for testing
       description: 'AI-generated explanations for incorrect answers'
     },

[Survived] ObjectLiteral
src/core/features.js:31:23
       phase: 'ENABLED',  // Share quiz results to social media
       description: 'Share quiz results with text, link, and image'
     },
-    SHOW_USAGE_COSTS: {
-      phase: 'ENABLED',  // Show LLM usage costs on results
-      description: 'Display token counts and costs after each quiz'
-    }
+    SHOW_USAGE_COSTS: {}
   };
 

[Killed] BlockStatement
src/core/features.js:43:70
    * @param {string} context - Where the feature is being used ('settings' | 'welcome' | 'home')
    * @returns {boolean}
    */
-  export function isFeatureEnabled(featureName, context = 'default') {
-    const feature = FEATURE_FLAGS[featureName];
-
-    if (!feature) {
-      console.warn(`[Features] Unknown feature: ${featureName}`);
-      return false;
-    }
-
-    switch (feature.phase) {
-      case 'DISABLED':
-        return false;
-      case 'SETTINGS_ONLY':
-        return context === 'settings';
-      case 'ENABLED':
-        return true;
-      default:
-        return false;
-    }
-  }
+  export function isFeatureEnabled(featureName, context = 'default') {}
 
   /**
killedBy: Feature Flags isFeatureEnabled should return false for unknown feature
statusReason: expected undefined to be false // Object.is equality

[Survived] StringLiteral
src/core/features.js:43:59
    * @param {string} context - Where the feature is being used ('settings' | 'welcome' | 'home')
    * @returns {boolean}
    */
-  export function isFeatureEnabled(featureName, context = 'default') {
+  export function isFeatureEnabled(featureName, context = "") {
     const feature = FEATURE_FLAGS[featureName];
 

[Killed] ConditionalExpression
src/core/features.js:46:9
   export function isFeatureEnabled(featureName, context = 'default') {
     const feature = FEATURE_FLAGS[featureName];
 
-    if (!feature) {
+    if (false) {
       console.warn(`[Features] Unknown feature: ${featureName}`);
       return false;
killedBy: Feature Flags isFeatureEnabled should return false for unknown feature
statusReason: Cannot read properties of undefined (reading 'phase')

[Survived] StringLiteral
src/core/features.js:52:12
     }
 
     switch (feature.phase) {
-      case 'DISABLED':
+      case "":
         return false;
       case 'SETTINGS_ONLY':

[Killed] ConditionalExpression
src/core/features.js:67:12
    * Get current phase for a feature (useful for debugging)
    */
   export function getFeaturePhase(featureName) {
-    return FEATURE_FLAGS[featureName]?.phase || 'UNKNOWN';
+    return false;
   }
killedBy: Feature Flags getFeaturePhase should return current phase for known feature
statusReason: expected [ 'DISABLED', 'SETTINGS_ONLY', …(1) ] to include false
