[Killed] ArrowFunction
src/core/state.js:87:42
       this.data.continueChain = {
         topic,
         continueCount: 0,
-        previousQuestions: questions.map(q => q.question),
+        previousQuestions: questions.map(() => undefined),
         startingGradeLevel: gradeLevel
       };
killedBy: AppState continue chain should initialize continue chain
statusReason: expected { topic: 'Math', …(3) } to deeply equal { topic: 'Math', …(3) }
