[Killed] ObjectLiteral
src/services/data-service.js:72:42
 
     logger.info('Data deletion complete');
   } catch (error) {
-    logger.error('Data deletion failed', { error: error.message });
+    logger.error('Data deletion failed', {});
     throw error;
   }
killedBy: Data Service deleteAllUserData should throw and log error if deletion fails
statusReason: expected "vi.fn()" to be called with arguments: [ 'Data deletion failed', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "Data deletion failed",
