[Killed] ObjectLiteral
src/utils/formatters.js:15:26
  */
 export function formatDate(date, options = {}) {
   const locale = getCurrentLanguage();
-  const defaultOptions = {
-    year: 'numeric',
-    month: 'short',
-    day: 'numeric'
-  };
+  const defaultOptions = {};
   return new Intl.DateTimeFormat(locale, { ...defaultOptions, ...options }).format(date);
 }
killedBy: Formatters formatDate should format date using Intl.DateTimeFormat with default options
statusReason: expected '6/15/2024' to contain 'Jun'

[Killed] EqualityOperator
src/utils/formatters.js:45:7
   if (diffDays === 1) return t('dates.yesterday');
 
   // Use Intl.RelativeTimeFormat for recent dates
-  if (diffDays < 7) {
+  if (diffDays >= 7) {
     const rtf = new Intl.RelativeTimeFormat(locale, { numeric: 'auto' });
     return rtf.format(-diffDays, 'day');
killedBy: Formatters formatRelativeDate should use Intl.RelativeTimeFormat for 2-6 days ago
statusReason: expected 'this week' to contain '3'

[Killed] EqualityOperator
src/utils/formatters.js:51:7
   }
 
   // Use Intl.RelativeTimeFormat for weeks
-  if (diffDays < 30) {
+  if (diffDays >= 30) {
     const weeks = Math.floor(diffDays / 7);
     const rtf = new Intl.RelativeTimeFormat(locale, { numeric: 'auto' });
killedBy: Formatters formatRelativeDate should switch to weeks format at exactly 7 days
statusReason: expected 'dec 29, 2025' to contain 'week'

[Killed] BlockStatement
src/utils/formatters.js:67:52
  * @param {Object} options - Intl.NumberFormat options
  * @returns {string} Formatted number string
  */
-export function formatNumber(number, options = {}) {
-  const locale = getCurrentLanguage();
-  return new Intl.NumberFormat(locale, options).format(number);
-}
+export function formatNumber(number, options = {}) {}
 
 /**
killedBy: Formatters formatNumber should format numbers using Intl.NumberFormat
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Killed] ArithmeticOperator
src/utils/formatters.js:83:35
   const locale = getCurrentLanguage();
   const { isRaw = false, ...intlOptions } = options;
 
-  const normalizedValue = isRaw ? value / 100 : value;
+  const normalizedValue = isRaw ? value * 100 : value;
 
   return new Intl.NumberFormat(locale, {
killedBy: Formatters formatPercent should handle raw percentage values (0-100)
statusReason: expected '850,000%' to be '85%' // Object.is equality
