[Killed] BlockStatement
src/utils/gradeProgression.js:24:29
   const startingIndex = GRADE_LEVELS.indexOf(startingLevel);
 
   // If starting level is not found, default to middle school
-  if (startingIndex === -1) {
-    return 'middle school';
-  }
+  if (startingIndex === -1) {}
 
   // Count how many thresholds have been passed
killedBy: gradeProgression calculateNextGradeLevel should handle invalid starting level by defaulting to middle school
statusReason: expected undefined to be 'middle school' // Object.is equality

[Killed] UpdateOperator
src/utils/gradeProgression.js:32:7
   let levelsToAdd = 0;
   for (const threshold of PROGRESSION_THRESHOLDS) {
     if (continueCount >= threshold) {
-      levelsToAdd++;
+      levelsToAdd--;
     }
   }
killedBy: gradeProgression calculateNextGradeLevel should return next level after 2 continues
statusReason: expected undefined to be 'middle school' // Object.is equality

[Killed] ArithmeticOperator
src/utils/gradeProgression.js:37:29
   }
 
   // Calculate new level, capped at college (index 3)
-  const newIndex = Math.min(startingIndex + levelsToAdd, GRADE_LEVELS.length - 1);
+  const newIndex = Math.min(startingIndex - levelsToAdd, GRADE_LEVELS.length - 1);
 
   return GRADE_LEVELS[newIndex];
killedBy: gradeProgression calculateNextGradeLevel should return next level after 2 continues
statusReason: expected undefined to be 'middle school' // Object.is equality

[Killed] BlockStatement
src/utils/gradeProgression.js:47:59
  * @param {number} continueCount - Current continue count
  * @returns {number|null} Continues until next level, or null if at max progression
  */
-export function getContinuesUntilNextLevel(continueCount) {
-  for (const threshold of PROGRESSION_THRESHOLDS) {
-    if (continueCount < threshold) {
-      return threshold - continueCount;
-    }
-  }
-  return null; // Already at max progression
-}
+export function getContinuesUntilNextLevel(continueCount) {}
 
killedBy: gradeProgression getContinuesUntilNextLevel should return continues until first threshold
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
src/utils/gradeProgression.js:48:51
  * @returns {number|null} Continues until next level, or null if at max progression
  */
 export function getContinuesUntilNextLevel(continueCount) {
-  for (const threshold of PROGRESSION_THRESHOLDS) {
-    if (continueCount < threshold) {
-      return threshold - continueCount;
-    }
-  }
+  for (const threshold of PROGRESSION_THRESHOLDS) {}
   return null; // Already at max progression
 }
killedBy: gradeProgression getContinuesUntilNextLevel should return continues until first threshold
statusReason: expected null to be 2 // Object.is equality
