[Killed] ArithmeticOperator
src/utils/shuffle.js:14:16
  */
 function fisherYatesShuffle(array) {
   const shuffled = [...array];
-  for (let i = shuffled.length - 1; i > 0; i--) {
+  for (let i = shuffled.length + 1; i > 0; i--) {
     const j = Math.floor(Math.random() * (i + 1));
     [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
killedBy: shuffleQuestionOptions should preserve all options (just reordered)
statusReason: expected [ 'C) 5', 'A) 3', undefined, …(3) ] to have a length of 4 but got 6

[Killed] EqualityOperator
src/utils/shuffle.js:14:37
  */
 function fisherYatesShuffle(array) {
   const shuffled = [...array];
-  for (let i = shuffled.length - 1; i > 0; i--) {
+  for (let i = shuffled.length - 1; i <= 0; i--) {
     const j = Math.floor(Math.random() * (i + 1));
     [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
killedBy: shuffleQuestionOptions should produce different orderings over multiple calls (statistical)
statusReason: expected 1 to be greater than 1

[Killed] ArrayDeclaration
src/utils/shuffle.js:16:34
   const shuffled = [...array];
   for (let i = shuffled.length - 1; i > 0; i--) {
     const j = Math.floor(Math.random() * (i + 1));
-    [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
+    [shuffled[i], shuffled[j]] = [];
   }
   return shuffled;
killedBy: shuffleQuestionOptions should preserve all options (just reordered)
statusReason: expected [ undefined, undefined, …(2) ] to deeply equal [ 'A) 3', 'B) 4', 'C) 5', 'D) 6' ]

[Killed] BlockStatement
src/utils/shuffle.js:36:41
   const { options, correct, ...rest } = question;
 
   // Handle edge cases
-  if (!options || options.length === 0) {
-    return question;
-  }
+  if (!options || options.length === 0) {}
 
   if (options.length === 1) {
killedBy: shuffleQuestionOptions should handle empty options array
statusReason: expected { question: 'No options?', …(2) } to deeply equal { question: 'No options?', …(2) }

[Killed] EqualityOperator
src/utils/shuffle.js:40:7
     return question;
   }
 
-  if (options.length === 1) {
+  if (options.length !== 1) {
     return question;
   }
killedBy: shuffleQuestionOptions should return a new object (not mutate original)
statusReason: expected { question: 'What is 2 + 2?', …(3) } not to be { question: 'What is 2 + 2?', …(3) } // Object.is equality

[Killed] ArrowFunction
src/utils/shuffle.js:49:47
   const shuffledIndices = fisherYatesShuffle(indices);
 
   // Reorder options based on shuffled indices
-  const shuffledOptions = shuffledIndices.map(i => options[i]);
+  const shuffledOptions = shuffledIndices.map(() => undefined);
 
   // Find new position of correct answer
killedBy: shuffleQuestionOptions should preserve all options (just reordered)
statusReason: expected [ undefined, undefined, …(2) ] to deeply equal [ 'A) 3', 'B) 4', 'C) 5', 'D) 6' ]

[Killed] LogicalOperator
src/utils/shuffle.js:69:7
  * @returns {Array<Object>} - New array with shuffled options in each question
  */
 export function shuffleAllQuestions(questions) {
-  if (!questions || !Array.isArray(questions)) {
+  if (!questions && !Array.isArray(questions)) {
     return questions;
   }
killedBy: shuffleAllQuestions should handle non-array input
statusReason: questions.map is not a function
